Hesham-14/embedded_system/Unit 8 - MCU Interfacing/L3 - UART Controller STM32/L3_UART_Controller_STM32F103C6_Driver/HAL/inc/LCD.h
/*
 * LCD.h
 *
 *  Created on: May 6, 2023
 *      Author: hesham mohamed
 */

#ifndef INC_LCD_H_
#define INC_LCD_H_

#include "STM32F103x6.h"
#include "STM32F103C6_GPIO_Driver.h"
#define F_CPU 1000000UL


//commands
#define SET_BIT(reg,bit) (reg |= (1<< bit))
#define CLR_BIT(reg,bit) (reg &= ~(1<< bit))
#define TOG_BIT(reg,bit) (reg ^= (1<< bit))

//define PORT
// from pin0-pin7: data
#define LCD_CTRL GPIOA
#define RS_SWITCH GPIO_PIN_8
#define RW_SWITCH GPIO_PIN_9
#define EN_SWITCH GPIO_PIN_10
#define DATA_shift 0 				//0 in 8 bit mode, 4 in 4 bit mode


//LCD Commands
#define LCD_FUNCTION_8BIT_2LINES	(0x38)
#define LCD_FUNCTION_4BIT_2LINES	(0x28)
#define LCD_MOVE_DISP_RIGHT			(0x1C)
#define LCD_MOVE_DISP_LIFT			(0x18)
#define LCD_MOVE_DISP_RIGHT			(0x14)
#define LCD_MOVE_DISP_LIFT			(0x10)
#define LCD_DISP_OFF				(0x08)
#define LCD_DISP_ON_CURSOR			(0x0E)
#define LCD_DISP_ON_CURSOR_BLINK	(0x0F)
#define LCD_DISP_ON_BLINK			(0x0D)
#define LCD_DISP_ON					(0x0C)
#define LCD_ENTRY_DEC				(0x04)
#define LCD_ENTRY_DEC_SHIFT			(0x05)
#define LCD_ENTRY_INC_				(0x06)
#define LCD_ENTRY_INC_SHIFT			(0x07)
#define LCD_BEGIN_AT_FIRST_ROW		(0x80)
#define LCD_BEGIN_AT_SECOND_ROW		(0xC0)
#define LCD_CLEAR_SCREEN			(0x01)
#define LCD_ENTRY_MODE				(0x06)
#define LCD_RETURN_HOME				(0x02)


//used functions
void LCD_init(void);
void LCD_command(uint8_t cmd);
void LCD_write_char(uint8_t data);
void LCD_write_string(uint8_t* data);
void LCD_isbusy(void);
void LCD_clear_screen(void);
int LCD_GOTO(uint8_t  line, uint8_t position);


#endif /* INC_LCD_H_ */
